<?php

$app_heading = "Налог за службено путовање";
$heading_01 = "НАЛОГ ЗА СЛУЖБЕНО ПУТОВАЊЕ";
$heading_02 = "На основу предњег налога извршио сам службено путовање и подносим следећи";
$heading_03 = "ПУТНИ РАЧУН";
$heading_04 = "Назив организације";
$departure = "Дан одласка ............................ у ................ час.";
$arrival = "Дан повратка ............................ у ................ час.";
$worker = "Радник - ца";
$work_place = "Распоређен - на на послове радног места";
$day_of_departure = "упућује се на службени пут дана:";
$vehicle = "На службеном путу користи превозно средство";
$per_diem = "Дневница за ово службено путовање припада у износу од дин.";
$way_till = "На службеном путу ће се задржати најдаље до";
$way_till_02 = "а у року од 48 часова по повратку са службеног пута и доласку на посао, поднеће писмени извештај о обављеном службеном послу. Рачун о учињеним путним трошковима поднети у року од три дана.";
$place_date = "У ................................... дана ...................... 20";
$confirmation_01 = "Потврђујем да је путовање извршено према овом налогу и одобравам исплату путног";
$confirmation_02 = "рачуна од динара";
$payment_approval = "Одобравам исплату аконтације у износу од динара";
$amount = "дин. ..........................";

/* $zaposleni = [
"Ljiljana Orlovic" => "psiholog",
"Olga Drbnjak" => "pedagog",
"Nevena Martic" => "bibliotekar",
]; */
