<?php include_once './../components/header.php'; ?>

<?php

// Data array
$analytic_accounts = [
  "Накнаде у натури" => "413100",
  "Помоћ у медицинском лечењу запосленог или чланова уже породице и друге помоћи запосленом" => "414400",
  "Накнаде трошкова за запослене" => "415100",
  "Награде запосленима и остали посебни расходи" => "416100",
  "Трошкови платног промета и банкарских услуга" => "421100",
  "Енергетске услуге" => "421200",
  "Комуналне услуге" => "421300",
  "Услуге комуникација" => "421400",
  "Трошкови осигурања" => "421500",
  "Трошкови службених путовања у земљи" => "422100",
  "Компјутерске услуге" => "423200",
  "Услуге образовања и усавршавања запослених" => "423300",
  "Услуге информисања" => "423400",
  "Репрезентација" => "423700",
  "Услуге образовања, културе и спорта" => "424200",
  "Медицинске услуге" => "424300",
  "Специјализоване услуге" => "424900",
  "Текуће поправке и одржавање зграда и објеката" => "425100",
  "Текуће поправке и одржавање опреме" => "425200",
  "Административни материјал" => "426100",
  "Материјали за образовање и усавршавање запослених" => "426300",
  "Материјали за образовање, културу и спорт" => "426600",
  "Материјали за одржавање хигијене и угоститељство" => "426800",
  "Материјали за посебне намене" => "426900",
  "Обавезне таксе" => "482200",
  "Пројектно планирање" => "511400",
  "Административна опрема" => "512200",
  "Опрема за заштиту животне средине" => "512400",
  "Опрема за образовање, науку, културу и спорт" => "512600",
  "Опрема за јавну безбедност" => "512800",
  "Трошкови путовања ученика" => "422400",
];

$subanalytic_accounts = [
  "Превоз на посао и са посла (маркица)" => "413151",
  "Помоћ у медицинском лечењу запосленог или члана уже породице" => "414411",
  "Накнаде трошкова за превоз на посао и са посла" => "415112",
  "Јубиларне награде" => "416111",
  "Трошкови платног промета" => "421111",
  "Услуге за електричну енергију" => "421211",
  "Централно грејање" => "421225",
  "Услуге водовода и канализације" => "421311",
  "Дератизација" => "421321",
  "Одвоз отпада" => "421324",
  "Телефон, телекс и телефакс" => "421411",
  "Интернет и слично" => "421412",
  "Пошта" => "421421",
  "Осигурање зграда" => "421511",
  "Трошкови дневница (исхране) на службеном путу" => "422111",
  "Трошкови превоза на службеном путу у земљи (авион, аутобус, воз, и сл.)" => "422121",
  "Превоз ученика" => "422411",
  "Трошкови путовања ученика који учествују на републичким и међународним такмичењима" => "422412",
  "Остале компјутерске услуге" => "423291",
  "Услуге образовања и усавршавања запослених" => "423311",
  "Котизација за семинаре" => "423321",
  "Остали издаци за стручно образовање" => "423399",
  "Остале услуге штампања" => "423419",
  "Репрезентација" => "423711",
  "Поклони" => "423712",
  "Услуге образовања" => "424211",
  "Здравствена заштита по уговору" => "424311",
  "Остале специјализоване услуге" => "424911",
  "Зидарски радови" => "425111",
  "Столарски радови" => "425112",
  "Молерски радови" => "425113",
  "Радови на крову" => "425114",
  "Радови на водоводу и канализацији" => "425115",
  "Централно грејање" => "425116",
  "Електричне инсталације" => "425117",
  "Остале услуге и материјали за текуће поправке и одржавање зграда" => "425119",
  "Рачунарска опрема" => "425222",
  "Текуће поправке и одржавање опреме за образовање" => "425261",
  "Текуће поправке и одржавање опреме за јавну безбедност" => "425281",
  "Канцеларијски материјал" => "426111",
  "Службена одећа" => "426122",
  "Стручна литература за редовне потребе запослених" => "426311",
  "Материјали за образовање" => "426611",
  "Хемијска средства за чишћење" => "426811",
  "Инвентар за одржавање хигијене" => "426812",
  "Остали материјал за одржавање хигијене" => "426819",
  "Потрошни материјал" => "426911",
  "Алат и инвентар" => "426913",
  "Остали материјали за посебне намене" => "426919",
  "Остале накнаде за образовање" => "472719",
  "Републичке таксе" => "482211",
  "Градске таксе" => "482231",
  "Електронска опрема" => "512241",
  "Пројектна документација" => "511451",
  "Опрема за заштиту животне средине" => "512411",
  "Опрема за образовање" => "512611",
  "Опрема за јавну безбедност" => "512811",
];

?>

<!-- main -->
<main>
  <!-- aside -->
  <aside class="aside-account-plan">
    <nav class="aside-container">
      <!--
          TODO:
            a) Create dropdown navigation like accordion,
            b) Align text content in <th> and <td> elements.
          -->
      <ul class="account-container">
        <?php foreach ($analytic_accounts as $title => $account) { ?>
        <li>
          <a href="#" title="<?php echo $title; ?>"><?php echo $account; ?></a>
        </li>
        <?php } ?>
      </ul>
      <a href="#"><i class="fas fa-arrow-up"></i> Врх стране</a>
    </nav>
  </aside>
  <!-- /aside -->

  <!-- content -->
  <section class="content">
    <article>
      <table class="account-plan" id="account-plan">
        <thead>
          <tr>
            <th>
              <form action="" class="search-bar" onkeyup="accountNumberSearch();">
                <div class="search-icon"><i class="fas fa-search"></i></div>
                <input type="text" id="search-bar-number" name="search-bar" size="6" placeholder="Конто" />
              </form>
            </th>
            <th>
              <form action="" class="search-bar" onkeyup="accountNameSearch();">
                <div class="search-icon"><i class="fas fa-search"></i></div>
                <input type="text" id="search-bar-name" name="search-bar" size="20" placeholder="Опис" />
              </form>
            </th>
          </tr>
        </thead>
        <tbody>
          <?php foreach ($subanalytic_accounts as $title => $account) { ?>
          <tr class="data-container">
            <td><?php echo $account; ?></td>
            <td><?php echo $title; ?></td>
          </tr>
          <?php } ?>
          <!-- /content -->
        </tbody>
      </table>

    </article>
  </section>
  <!-- /content -->
</main>
<!-- /main -->

<?php include_once './../components/footer.php'; ?>