<?php include_once './../components/header.php'; ?>

<?php

// data array
$alphabet_array = [
  "А", "Б", "В", "Г", "Д", "Ђ", "Е", "Ж", "З", "И", "Ј", "К", "Л", "Љ", "М", "Н", "Њ", "О", "П", "Р",
  "С", "Т", "Ћ", "У", "Ф", "Х", "Ц", "Ч", "Џ", "Ш"
];

$address_book = [
  "Перишић Жаклина" => "031 33 10 296",
  "Марјановић Јасна" => "031 33 10 296",
  "Малинић Марија" => "031 33 10 296",
  "Станишић Ивана" => "031 33 10 296",
  "Јовановић Јелена" => "031 33 10 296",
  "Арсић Данијела" => "031 33 10 296",
  "Петровић Сузана" => "031 33 10 296",
  "Ђајић Гордана" => "031 33 10 296",
  "Симовић Катарина" => "031 33 10 296",
  "Недељковић Марија" => "031 33 10 296",
  "Миловановић Јована" => "031 33 10 296",
  "Мајсторовић Јасмина" => "031 33 10 296",
  "Крстић Татјана" => "031 33 10 296",
  "Зарић Златана" => "031 33 10 296",
  "Даниловић Драгана" => "031 33 10 296",
  "Миловановић Слободан" => "031 33 10 296",
  "Милуновић Ана" => "031 33 10 296",
  "Булатовић Јасмина" => "031 33 10 296",
  "Миљковић Гордана" => "031 33 10 296",
  "Ђорђевић Снежана" => "031 33 10 296",
  "Бркушанин Драгана" => "031 33 10 296",
  "Шућур Весна" => "031 33 10 296",
  "Илић Оливера" => "031 33 10 296",
  "Пајовић Лидија" => "031 33 10 296",
  "Ђонић Јелена" => "031 33 10 296",
  "Кастратовић Гордана" => "031 33 10 296",
  "Грковић Александра" => "031 33 10 296",
  "Каличанин Ана" => "031 33 10 296",
  "Дедовић Вукашин" => "031 33 10 296",
  "Савић Радуна" => "031 33 10 296",
  "Стефановић Марија" => "031 33 10 296",
  "Попадић Алекса" => "031 33 10 296",
  "Слијепчевић Данијела" => "031 33 10 296",
  "Киковић Гордана" => "031 33 10 296",
  "Ерац Љиљана" => "031 33 10 296",
  "Трујић Кристина" => "031 33 10 296",
  "Милићевић Драгана" => "031 33 10 296",
  "Великинац Предраг" => "031 33 10 296",
  "Недељковић Снежана" => "031 33 10 296",
  "Недељковић Златко" => "031 33 10 296",
  "Божовић Љиљана" => "031 33 10 296",
  "Китановић Наташа" => "031 33 10 296",
  "Лешевић Ненад" => "031 33 10 296",
  "Јаковљевић Зоран" => "031 33 10 296",
  "Мартић Невена" => "031 33 10 296",
  "Орловић Љиљана" => "031 33 10 296",
  "Дробњак Олга" => "031 33 10 296",
  "Дабижљевић Бранка" => "031 33 10 296",
  "Бекчић Ленче" => "031 33 10 296",
  "Ђорђевић Марија" => "031 33 10 296",
  "Трифуновић Анђелка" => "031 33 10 296",
  "Савић Славица" => "031 33 10 296",
  "Сретовић Светлана" => "031 33 10 296",
  "Ђуровић Наташа" => "031 33 10 296",
  "Терзић Драгана" => "031 33 10 296",
  "Томић Тома" => "031 33 10 296",
  "Банковић Милена" => "031 33 10 296",
];

?>

<!-- main -->
<main>
  <aside class="aside-address-book">
    <nav class="aside-container">
      <ul class="address-book-container">
        <?php foreach ($alphabet_array as $alphabet_letter) { ?>
        <li>
          <a href="#"><?php echo $alphabet_letter; ?></a>
        </li>
        <?php } ?>
      </ul>
      <a href="#"><i class="fas fa-arrow-up"></i> Врх стране</a>
    </nav>
  </aside>
  <!-- /aside -->

  <!-- content  -->
  <section class="content">
    <article>

      <!-- search bar -->
      <form action="" class="search-bar" onkeyup="contactSearch();">
        <div class="search-icon"><i class="fas fa-search"></i></div>
        <input type="text" id="search-bar" name="search-bar" size="20" placeholder="Претрага" />
      </form>

      <!-- /search bar -->
      <table class="address-book" id="address-book">
        <thead>
          <tr>
            <th>Презиме и име</th>
            <th>Контак телефон</th>
          </tr>
        </thead>
        <tbody>
          <?php foreach ($address_book as $name => $phone_number) { ?>
          <tr class="data-container">
            <td><?php echo $name; ?></td>
            <td><?php echo $phone_number; ?></td>
          </tr>
          <?php } ?>
        </tbody>
      </table>
    </article>
  </section>
  <!-- /content -->
</main>
<!-- /main -->

<?php include_once './../components/footer.php'; ?>